*> SPDX-License-Identifier: AGPL-3-or-later <*

*> *************************************
*> *** Author - Eduardo Pozos Huerta ***
*> *** File   - files.status.cpy     ***
*> *** Date   - 03/10/2025           ***
*> *** Update - 03/10/2025           ***
*> *************************************

*> ****************
*> *** RFS-FILE ***
*> ****************

01 RFS-STATUS PIC X(2).
